

import 'package:tourism/model/temples/m_temples.dart';


class ControllerTemple{
  List<ModelTempleApp> dataTemples = [
    /// index 0
    ModelTempleApp(
      id:"1",
      title: "معبد ابو سمبل",
      image: 'assets/images/temples/abusmbl.jpg',
      imagetemple: 'assets/images/temples/abu1.jpg',
      location: 'هو موقع أثري يقع على الضفة الغربية لبحيرة ناصر نحو 290 كم جنوب غرب أسوان. وهو أحد مواقع «آثار النوبة» المدرجة ضمن قائمة اليونسكو لمواقع التراث ...ة',
      brief: 'يعد معبد أبو سمبل الكبير، الواقع في النوبة بالقرب من الحدود الجنوبية لمصر، من بين المعالم الأكثر روعة في مصر، بناه الملك رمسيس الثاني من الأسرة التاسعة عشرة تم قطعه كاملاً في الجبل، حوالي عام 1264 قبل الميلاد. يشتهر المعبد بتماثيله الأربعة الضخمة جالسة والتي تزين واجهته، والتي انهار أحدها بسبب زلزال قديم ولا تزال بقاياه على الأرض',
      siteurl: 'https://egymonuments.gov.eg/ar/archaeological-sites/abu-simbel/',
      youtube: 'https://www.youtube.com/watch?v=aDi-GCcSGaM&t=8s',
    
    ),

    /// index 1
    ModelTempleApp(
       id:"2",
      title: "معبد الاقصر",
      image: 'assets/images/temples/louxor.jpg',
       imagetemple: '',
    location: 'معبد الأقصر معبد كبير من المعابد المصرية القديمة المعقدة يقع على الضفة الشرقية لنهر النيل في مدينة الأقصر اليوم المعروفة باسم (طيبة القديمة). تأسس سنة 1400 قبل الميلاد.',
          brief: 'يقع المعبد على بعد حوالي ثلاثة كيلومترات إلى الجنوب من معبد الكرنك، والذي كان مرتبطًا ذات مرة بطريق مسير يحده على جانبيه تماثيل أبو الهول وأبو الهول برأس الكبش. يرجع أقدم دليل على هذا المعبد إلى الأسرة الثامنة عشرة (حوالي 1550 - 1295 ق.م).لم يكن معبد الأقصر مثل معظم المعابد المصرية القديمة الأخرى على محور شرق-غرب، ولكنه موجه نحو الكرنك، هذا لأن معبد الأقصر كان المكان الرئيسي لأحد أهم الاحتفالات الدينية المصرية القديمة حين كان يتم نقل تماثيل كل من المعبودات آمون وزوجته موت وابنهما رب القمر خونسو من معابدهم في الكرنك في موكب مهيب إلى معبد الأقصر حتى يتمكنوا من زيارة المعبود المقيم هناك آمون إم أوبت وهو الاحتفال المعروف باسم عيد الأوبت',
      siteurl: 'https://egymonuments.gov.eg/ar/monuments/luxor-temple/',
      youtube: 'https://www.youtube.com/watch?v=3CqjbjBc7mM',
    ),

    /// index 2
    ModelTempleApp(
       id:"3",
      title: "معبد فيله",
      image: 'assets/images/temples/fila.jpg',
       imagetemple: 'assets/images/temples/abu1.jpg',
     location: 'جزيرة فيلة، هي جزيرة في منتصف نهر النيل وهي إحدى الحصون الأقوى على طول حدود مصر الجنوبية، وتفصل النيل إلى قناتين معاكستين في أسوان، كان بها معبد فيلة وانتقل من مكانه الأصلي على جزيرة فيلة وتم تجميعه على جزيرة أجيليكا، وذلك في أعقاب بناء السد العالي',
     brief: 'تم بناء المعبد الكبير خلال القرن الثالث قبل الميلاد تم تلاه معابد أمنحوتب وأرسنوفيس. أما معبد حتحور فهو يعد آخر أثر بطلمي واستكمل بنائه قبل عام 116 قبل الميلاد بواسطة إيورجيتس الثاني. وقد أضاف بطالمة آخرون نقوشا إلى فيلة والتي تعتبر من روائع المعبد. ومن مصر امتدت عبادة الآلهة إيزيس إلى اليونان وروما وفي مختلف أنحاء الإمبراطورية حتى عندما تم تطبيق الحكم الروماني في مصر حاول الحكام تجميل الجزيرة المقدسة فقد بنى الإمبراطور أغسطس قيصر معبد في الطرف الشمالي لفيلة في القرن التاسع قبل الميلاد. أما تيبيريوس وآخرون فقد أضافوا صروحاً ونقوشا، كما بنى كلاوديوس وتراجان وهادريان ودقلديانوس مبانٍ جديدة بالجزيرة استمر العمل فيها حتى القرن الرابع الميلادي.ولشدة سيطرة عبادة إيزيس في جزيرة فيلة أدى ذلك إلى امتداد تلك العبادة على مدى قرون عديدة متحدية بذلك مرسوم الإمبراطور ثيودوسيوس الأول الذي أصدره عام 391 ميلادية والذي يفرض فيه الديانة المسيحية على جميع أنحاء الإمبراطورية الرومانية. وفي عام 550 بعد الميلاد وتحت حكم جوستنيان وصلت المسيحية إلى جزيرة فيلة وبدأت صفحة جديدة في تاريخها. وتكون مجتمع جديد مسيحي في جزيرة فيلة وتحولت قاعة الأعمدة لتكون مناسبة لممارسة الديانة الجديدة. وتم نقل الأحجار من بعض الآثار لبناء كنائس مسيحية في الجزيرة. ونمت قرية جديدة حول معبد إيزيس.',
      siteurl: 'https://egymonuments.gov.eg/ar/archaeological-sites/philae/',
      youtube: 'https://www.youtube.com/watch?v=xGfVCyB1oNU',
    ),

    /// index 3
    ModelTempleApp(
       id:"4",
      title: "معبد حتشبسوت",
      image: 'assets/images/temples/htshbsoot.jpg',
       imagetemple: 'assets/images/temples/abu1.jpg',
    location: ' الظهير الصحراوى للقرنة، محافظة الأقصر',
    brief: 'يقع معبد حتشبسوت على أسفل منحدر صخري شاهق بالقرب من الضفة الغربية للنيل، ويعرف المعبد أيضا باسم الدير البحري وهو خاص لعبادة آمون رع، إله الشمس، وقد صمم هذا المعبد مهندس يدعى سينيموت. ويعتبر المعبد فريدا من نوعه لتصميمه الشبيه بتصاميم البناء الكلاسيكية. ويمكنك ملاحظة شرفة المعبد الطويلة المليئة بصفوف من الأعمدة التي يبلغ ارتفاع بعضها 97 قدما، والأبراج والساحات والقاعة ذات السقف المرتكز على أعمدة. وفي داخل المعبد، يمكنك رؤية قاعة الشمس والمعبد الصغير والمذبح. وتحكي النقوش على جدران المعبد قصة ولادة الملكة حتشبسوت ورحلاتها التجارية إلى بلاد بونت المعروفة الآن بدولة الصومال الحديثة أو شبه الجزيرة العربية.يتكون معبد حتشبسوت من ثلاث طوابق فضلا عن عدد كبير من التماثيل المصنوعة كليا من الحجر الجيري لعدد من الآلهة مثل تماثيل للإله أوزوريس وللملكة حتشبسوت.',
      siteurl: 'https://beta.sis.gov.eg/ar/%D9%85%D8%B5%D8%B1/%D8%A7%D9%84%D8%B3%D9%8A%D8%A7%D8%AD%D8%A9/%D8%A7%D8%AB%D8%A7%D8%B1/%D9%85%D8%B9%D8%A8%D8%AF-%D8%AD%D8%AA%D8%B4%D8%A8%D8%B3%D9%88%D8%AA/',
      youtube: 'https://www.youtube.com/watch?v=1865Fi-IxMM',
    ),

    /// index 4
    ModelTempleApp(
       id:"5",
      title: "معبد مدينة هابو",
      image: 'assets/images/temples/hapo.jpeg',
       imagetemple: 'assets/images/temples/abu1.jpg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'مدينة هابو منطقه اثرية تقع جنوب جبانة طيبة، على الضفة الغربية لنهر النيل، تضم العديد من الآثار الهامة. وأهم اثارها معبد رمسيس الثالث الذي يعد من أعظم معابد الأسرة العشرون. زخر محيط مدينة هابو بالعديد من الصروح ولكن أشهرها على الإطلاق وأكثرها تمتعًا بالدراسة هو المعبد الجنازيُّ لرمسيس الثالث. وهو أيضًا واحد من أفضل المعابد حفظًا في مصر وقد عُرف في مصر القديمة بقصر «ملايين السنين لملك مصر العليا والسفلى» «وسر ماعت رع مري أمون» في رحاب آمون بغرب طيبة.',
      siteurl: 'https://egyptiangeographic.com/ar/news/show/88',
      youtube: 'https://www.youtube.com/watch?v=R6VpS5eT3vg',
    ),
     ModelTempleApp(
       id:"6",
      title: "معبد دندره",
      image: 'assets/images/abdeen.jpeg',
       imagetemple: 'assets/images/temples/dndara.jpg',
    location: '-محافظة قنا - دندره -  ',
    brief: 'مجمع المعابد في دندرة دندرة (بالمصرية القديمة: Iunet أو Tantere؛ النُطق الإنگليزي في القرن 19 في معظم المصادر، ويشمل بلزوني، كان Tentyra)، يقع على بعد حوالي 2.5 كم جنوب شرق دندرة، مصر، وعلى بعد خمسة كيلومترات شمال غرب مدينة قنا. وهو واحد من أفضل مجمعات المعابد المحفوظة في مصر. كانت المنطقة هي النوم السادس (تقسيم اداري) في مصر السفلى، جنوب أبيدوس. ويقع مجمع المعابد على الضفة الغربية من النيل على بعد 665 كم جنوب القاهرة وكان يعبد فيه الإلهة حتحور (إلهة السماء والخصب) عند قدماء المصريين. أقيم معبد دندرة في أيام بيبي الأول وجدده البطالمة.',
      siteurl: 'https://www.presidency.eg/ar/%D8%A7%D9%84%D9%82%D8%B5%D9%88%D8%B1-%D8%A7%D9%84%D8%B1%D8%A6%D8%A7%D8%B3%D9%8A%D8%A9/%D9%82%D8%B5%D8%B1-%D8%B9%D8%A7%D8%A8%D8%AF%D9%8A%D9%86/',
      youtube: 'https://www.youtube.com/watch?v=8lxj5QZh0xE',
    ),
     ModelTempleApp(
       id:"7",
      title: "معبد أمنحتب الثالث",
      image: 'assets/images/amn.jpeg',
       imagetemple: 'assets/images/temples/amn.jpg',
    location: 'لمعبد الجنائزي لأمنحتب الثالث، هو من المعابد الجنائزية التي كانت تبنى للأموات في مصر القديمة، يقع هذا المعبد أمام معبد مرنبتاح مباشرة، ويعتبر هذا المعبد متحف مكشوف له سحره يستطيع فيه المرء ان يتبع التخطيط الأصلي للمعبد.',
    brief: 'لمتحف الزراعي في مصر كان الغرض من إنشائه هو التوثيق لذاكرة مصر الزراعية، ونافذة تطل منها كل الأجيال علي حضارة مصر الزراعية، فضلاً عن كونه مركزاً للثقافة الزراعية، وكان المتحف قد أقيم في سراي الأميرة فاطمة إسماعيل ابنة الخديوي إسماعيل في حي الدقي، وقد بدأ العمل به في عام 1930 عندما صدر قرار مجلس الوزراء المصري في 21 نوفمبر من عام 1927، وأطلق عليه في البداية اسم «متحف فؤاد الأول الزراعي». ويمكن اعتبار هذا المتحف ثمانية متاحف لا متحف واحد، وتزيد مساحة هذا المتحف علي ثلاثين فداناً، أي ما يعادل 175ألف متر مربع، ويعد أول متحف زراعي في العالم،',
      siteurl: 'https://beta.sis.gov.eg/ar/%D9%85%D8%B5%D8%B1/%D8%A7%D9%84%D8%B3%D9%8A%D8%A7%D8%AD%D8%A9/%D9%85%D8%AA%D8%A7%D8%AD%D9%81/%D8%A7%D9%84%D9%85%D8%AA%D8%AD%D9%81-%D8%A7%D9%84%D8%B2%D8%B1%D8%A7%D8%B9%D9%8A/',
      youtube: 'https://www.youtube.com/watch?v=fYvBf_EUHbM',
    ),
     ModelTempleApp(
       id:"8",
      title: "معبد حورس",
      image: 'assets/images/edfo.jpeg',
       imagetemple: 'assets/images/temples/edfo.jpg',
    location: 'اسوان -ادفو ',
    brief: 'معبد إدفو أو معبد حورس، هو ثاني معابد مصر القديمة حجماً، بعد معبد الكرنك، يقع بمدينة إدفو في صعيد مصر على الضفة الغربية لنهر النيل والتي عُرفّت خلال الفترة الهلينستية في اليونانية العامية باسم (Ἀπόλλωνος πόλις) وفي اللاتينية (Apollonopolis Magna)، يمثل المعبد إحدى آخر محاولات البطالمة لبناء معابد على نسق أسلافهم هيئة وفخامة. استغرق بناء معبد حورس نحو 180 سنة.كُرس المعبد للإله الرئيسي حورس، الذي حُددّ بوصفه أبولو بموجب التفسير الإغريقي.[3] وهو أحد أفضل المزارات المحفوظة في مصر. شُيدّ المعبد إبان حكم المملكة البطلمية بين 237 و57 ق. م. وتقدم النقوش على جدرانه معلومات مهمة عن اللغة والأساطير والدين خلال الفترة الهلنستية في مصر. وخاصة، أن نصوص بناء المعبد المنقوشة «تقدم تفاصيل [على حد سواء] عن بنائه وكذلك حفظ معلومات حول التفسير الأسطوري له ولكل المعابد الأخرى كجزيرة الخلق».[4] توجد أيضاً «مشاهد ونقوش مهمة من الدراما المقدسة التي تروي الصراع القديم بين حورس وسيث.»[4] فُسرّت خلال مشروع إدفو الألماني. خيث تذكر الرموز والحروف المحفورة الطقوس التي اتُبعت قديماً أن مبنى المعبد شُيد حيث دارت معركة عظيمة بين «حورس» و«ست».',
      siteurl: 'https://egymonuments.gov.eg/ar/museums/mummification-museum',
      youtube: 'https://www.youtube.com/watch?v=DTMVVUnJR7k',
    ),
     ModelTempleApp(
       id:"9",
      title: "معبد كلابشة",
      image: 'assets/images/Klabsha.jpg',
        imagetemple: 'assets/images/temples/abu1.jpg',
      location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
      brief: 'معب كلابشة المعروف أيضاً بمعبد ماندوليس هو معبد مصري قديم موقعه الأصلى باب الكلابشة حوالى 50 كم جنوب أسوان.  المعبد كان يقع على الضفة الغربية للنيل وتم بنائه حوالى عام 30 قبل الميلاد خلال الحكم الرومانى لمصر. و هو معبد لعبادة الآلهة ماندوليس إله الشمس عند النوبيين. و تم إنشاؤه على أطلال معبد آخر للملك أمنحوتب الثالث و تم بناؤه في عهد الإمبراطور أغسطس لكن لم يتم الانتهاء منه. تبلغ أبعاد المعبد 76 متر طولاً و 22 متر عرضاً. و على الرغم من أن المعبد أنشئ في العصر الرومانى إلا أنه يحتوى على رسوم للإله حورس على الحائط الداخلى للمعبد. و يحتوى المعبد على درج يؤدى للسطح الذي يطل على منظر مفتوح للمعبد والبحيرة المقدسة. توجد العديد من السجلات التاريخية على جدران المعبد منها أوامر القائد الرومانى أورليوس بيساريون عام 250 ميلادية والتي يمنع فيها دخول الخنازير للمعبد وكذلك كتابات للملك النوبى سيلكو والتي يسجل فيها انتصاراته على بلميس ويمثل نفسه كجندى رومانى على ظهر فرس  و سيلكو كان ملك نوبى مسيحى لمملكة نوباتيا.',
      siteurl: 'https://beta.sis.gov.eg/ar/%D8%A7%D9%84%D9%85%D8%B1%D9%83%D8%B2-%D8%A7%D9%84%D8%A5%D8%B9%D9%84%D8%A7%D9%85%D9%8A/%D8%A7%D9%84%D9%81%D8%B9%D8%A7%D9%84%D9%8A%D8%A7%D8%AA/%D8%AA%D8%B9%D8%A7%D9%85%D8%AF-%D8%A7%D9%84%D8%B4%D9%85%D8%B3-%D8%B9%D9%84%D9%89-%D9%82%D8%AF%D8%B3-%D8%A7%D9%84%D8%A3%D9%82%D8%AF%D8%A7%D8%B3-%D8%A8%D9%85%D8%B9%D8%A8%D8%AF-%D8%A2%D9%85%D9%88%D9%86-%D8%B1%D8%B9-%D9%81%D9%8A-%D8%A7%D9%84%D9%83%D8%B1%D9%86%D9%83/',
      youtube: 'https://www.youtube.com/watch?v=CMR-ReioQtQ',
    
    ),
    ModelTempleApp(
       id:"10",
      title: "متحف الشمع",
      image: 'assets/images/shame.jpeg',
        imagetemple: 'assets/images/temples/abu1.jpg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'متحف الشمع في حلوان متحف مصري يقع في مدينة حلوان بالقاهرة، تم تأسيسه عام 1934، ويضم المتحف العديد من الأعمال الفنية من الشمع وكذلك مقتنيات نادرة لمراحل تطور التاريخ المصري، بداية من الفراعنة وصولا إلى العصر الحديث، يوجد بالمتحف العديد من تماثيل شمعية صنعت بدقة متناهية دفعت متخصصين إلى تصنيفه في المركز الرابع في قائمة أفضل متاحف الشمع في العالم، كما صنف ثاني أشهر متحف شمع في العالم',
      siteurl: 'http://www.moc.gov.eg/ar/affiliates-list/%D9%81%D9%86%D9%88%D9%86-%D8%AA%D8%B4%D9%83%D9%8A%D9%84%D9%8A%D8%A9/%D9%85%D8%AA%D8%AD%D9%81-%D8%A7%D9%84%D8%B4%D9%85%D8%B9/',
      youtube: 'https://www.youtube.com/watch?v=Lzp0Pbzcwz0',
    ),
   
  ];
  /// [getLength] return number item in list
  int getLength() => dataTemples.length;

  /// [getArticle] return dataArticle by index
  ModelTempleApp getTemple(int index) => dataTemples.elementAt(index);

}