
import 'package:tourism/model/musiems/m_musiems.dart';


class ControllerMusem{
  List<ModelMusiemApp> dataMusem = [
    /// index 0
    ModelMusiemApp(
      id:"1",
      title: "المتحف المصري",
      image: 'assets/images/eltahrir.jpg',
      location: 'ميدان التحرير - القاهرة',
      brief: 'هو أحد أكبر وأشهر المتاحف العالمية، يقع في قلب العاصمة المصرية «القاهرة» بالجهة الشمالية لميدان التحرير. يعود تاريخ إنشائه إلى عام 1835 وكان موقعه حينها بحديقة الأزبكية، حيث ضم وقتها عدداً كبيرًا من الآثار المتنوعة، ثم نقل بمحتوياته إلى قاعة العرض الثانية بقلعة صلاح الدين، حتى فكر عالم المصريات الفرنسي أوجوست مارييت الذي كان يعمل بمتحف اللوفر في افتتاح متحف يعرض فيه مجموعة من الآثار على شاطئ النيل عند بولاق، وعندما تعرضت هذه الآثار لخطر الفيضان تم نقلها إلى ملحق خاص بقصر الخديوي إسماعيل بالجيزة، ثم جاء عالم المصريات جاستون ماسبيرو وافتتح عام 1902 في عهد الخديوي عباس حلمي الثاني مبنى المتحف الجديد في موقعه الحالي في قلب القاهرة.',
      siteurl: 'https://egymonuments.gov.eg/ar/museums/egyptian-museum',
      youtube: 'https://www.youtube.com/watch?v=r-qeP51pOms&t=1s',
    
    ),

    /// index 1
    ModelMusiemApp(
       id:"2",
      title: "المتحف القومي للحضارة ",
      image: 'assets/images/elhdara.jpg',
    location: 'عين الصيرة، قسم مصر القديمة، محافظة القاهرة',
          brief: 'هو متحف يقع في مدينة الفسطاط بالقاهرة علي مساحة 33.5 فدان. ويستوعب المتحف خمسين ألف قطعة أثرية تحكي مراحل تطور الحضارة المصرية بالإضافة إلى عرض لإنجازات الإنسان المصري في مجالات الحياة المختلفة منذ فجر التاريخ حتى وقتنا الحاضر، كما يحتوى على نماذج وصور فوتوغرافية ومخطوطات ولوحات زيتية وتحف فنية وآثار من العصر الحجري والفرعوني واليوناني الروماني والقبطي والعربي وحضارة السودان والعصر الحديث. ويطل موقع المتحف على بحيره طبيعية وهي بحيرة عين الصيرة.',
      siteurl: 'https://egymonuments.gov.eg/ar/museums/national-museum-of-egyptian-civilization-nmec',
      youtube: 'https://www.youtube.com/watch?v=29bpc29yODo',
    ),

    /// index 2
    ModelMusiemApp(
       id:"3",
      title: "متحف الفن الإسلامي",
      image: 'assets/images/islamy.jpg',
     location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
     brief: 'متحف الفن الإسلامي بالقاهرة يعد أكبر متحف إسلامي بالعالم حيث يضم مجموعات متنوعة من الفنون الإسلامية من الهند والصين وإيران مرورا بفنون الجزيرة العربية والشام ومصر وشمال أفريقيا والأندلس. أصدر الخديوى توفيق أمر إلى نظارة الأوقاف سنه ١٨٨١م لجمع كل التحف الفنية النفيسة الموجودة في المساجد والبيوت الإسلامية فظهر لأول مرة في العالم متحف الآثار الإسلامية وكان عبارة عن غرفة واحده سمح للجمهور بزيارتها لدراسة ما بها من آثار وفى عام ١٨٨٤م أصبح مسجد الحاكم بأمر الله هو مقر لدار الآثار العربية وتشرف علية لجنه حفظ الآثار',
      siteurl: 'https://egymonuments.gov.eg/ar/museums/museum-of-islamic-art',
      youtube: 'https://www.youtube.com/watch?v=YSkZCMAZkZc',
    ),

    /// index 3
    ModelMusiemApp(
       id:"4",
      title: "متحف الأقصر",
      image: 'assets/images/loxour.jpeg',
    location: 'الاقصر - الكورنيش ',
    brief: 'متحف الأقصر يقع على كورنيش النيل في وسط مدينة الأقصر جنوب مصر والتي كانت تعرف في الماضي باسم طيبة. افتتحه الرئيس الأسبق محمد أنور السادات مع ضيفه رئيس جمهورية فرنسا وقتها، فاليرى جاسيكار دى ستان في العام 1975 م. لكن موجوداته لم تكن لتقارن بأي حال من الأحوال بمعروضات متحف القاهرة للآثار الذي يحوي أروع نفائس الحضارة المصرية القدية داخل مصر. من بين أروع معروضات المتحف حالياً مجموعة من التحف والتي كانت ضمن مقبرة الملك توت عنخ آمون، أيضاً تماثيل تمثل عصر المملكة الحديثة عثر عليها مخبأة قرب معبد الأقصر العام 1989 م. كذلك تجد المومياوات الملكية للفرعونين أحمس الأول ورمسيس الأول حيث أضيفت لمقتنيات المتحف في مارس 2004 م. كجزء من التجديدات في المتحف والتي تضمنت مركزا للزوار وأضيف فيها ومعرضا كبيراً لإعادة ترميم حوائط معبد أخناتون في الكرنك',
      siteurl: 'https://egymonuments.gov.eg/ar/news/luxor-museum-is-a-spectacular-museum-that-includes-a-variety-of-rare-artifacts-discovered-in-luxor/',
      youtube: 'https://www.youtube.com/watch?v=6a5UTt8aF7E',
    ),

    /// index 4
    ModelMusiemApp(
       id:"5",
      title: "المتحف القبطى",
      image: 'assets/images/qbty.jpg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'ع هذا المتحف في مصر القديمة داخل حدود حصن بابليون والذي توجد بقاياه خلف مبنى المتحف؛ وقد بدأ تشييده أيام الفرس ولكن حدثت عليه العديد من الإضافات في عهد الإمبراطوريين الرومانيين أغسطس وتراجان ثم أضاف إليه من جاء بعدهم من أباطرة الرومان. لعب العالم الفرنسي (ماسبيرو) دوراً هامة في نشأة المتحف إذ عمل على جمع أعمال الفن القبطي وتخصيص قاعة لها في المتحف المصري. بعد ذلك طالب مرقس باشا سميكة عام 1893م بأن تضم مجموعة الآثار القبطية إلى اهتمامات لجنة حفظ الآثار والفنون. وقد جاهد هذا الرجل طويلاً حتى تمكن من إقامة المبنى الحالي للمتحف الذي افتتح عام 1910 وعين هو أول مدير له. أما أول دليل للمتحف فتم نشره عام 1930.',
      siteurl: 'https://egymonuments.gov.eg/ar/museums/the-coptic-museum',
      youtube: 'https://www.youtube.com/watch?v=zBAIkQUFz-k',
    ),
     ModelMusiemApp(
       id:"6",
      title: "قصر عابدين",
      image: 'assets/images/abdeen.jpeg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'هو أحد أشهر قصور مصر التاريخية. شهد الكثير من الأحداث منذ العهد الملكي وحتى نشأة القاهرة الحديثة.يُعد قصر عابدين تحفة تاريخية نادرة بالشكل الذي حوّله إلى متحف يعكس الفخامة التي شُيّد بها القصر والأحداث الهامة التي شهدها منذ العصر الملكي وحتى قيام ثورة يوليو 1952.ويحرص الكثير من المهتمين بالمتاحف على زيارته؛ حيث يُعد من أهم وأشهر القصور التي شيّدت خلال حكم أسرة محمد علي باشا لمصر؛ حيث كان مقراً للحكم من العام 1872 حتى العام 1952.شهد القصر أحداثاً لها دوراً كبيراً في تاريخ مصر الحديث والمعاصر، كما أنه يُعد البداية الأولى لظهور القاهرة الحديثة ففي نفس الوقت الذي كان يجرى فيه بناء القصر أمر الخديوي إسماعيل بتخطيط القاهرة على النمط الأوروبي من ميادين فسيحة وشوارع واسعة وقصور ومباني وجسور على النيل وحدائق غنية بالأشجار وأنواع النخيل والنباتات النادرة',
      siteurl: 'https://www.presidency.eg/ar/%D8%A7%D9%84%D9%82%D8%B5%D9%88%D8%B1-%D8%A7%D9%84%D8%B1%D8%A6%D8%A7%D8%B3%D9%8A%D8%A9/%D9%82%D8%B5%D8%B1-%D8%B9%D8%A7%D8%A8%D8%AF%D9%8A%D9%86/',
      youtube: 'https://www.youtube.com/watch?v=8lxj5QZh0xE',
    ),
     ModelMusiemApp(
       id:"7",
      title: "المتحف الزراعى المصرى",
      image: 'assets/images/zari.jpeg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'لمتحف الزراعي في مصر كان الغرض من إنشائه هو التوثيق لذاكرة مصر الزراعية، ونافذة تطل منها كل الأجيال علي حضارة مصر الزراعية، فضلاً عن كونه مركزاً للثقافة الزراعية، وكان المتحف قد أقيم في سراي الأميرة فاطمة إسماعيل ابنة الخديوي إسماعيل في حي الدقي، وقد بدأ العمل به في عام 1930 عندما صدر قرار مجلس الوزراء المصري في 21 نوفمبر من عام 1927، وأطلق عليه في البداية اسم «متحف فؤاد الأول الزراعي». ويمكن اعتبار هذا المتحف ثمانية متاحف لا متحف واحد، وتزيد مساحة هذا المتحف علي ثلاثين فداناً، أي ما يعادل 175ألف متر مربع، ويعد أول متحف زراعي في العالم،',
      siteurl: 'https://beta.sis.gov.eg/ar/%D9%85%D8%B5%D8%B1/%D8%A7%D9%84%D8%B3%D9%8A%D8%A7%D8%AD%D8%A9/%D9%85%D8%AA%D8%A7%D8%AD%D9%81/%D8%A7%D9%84%D9%85%D8%AA%D8%AD%D9%81-%D8%A7%D9%84%D8%B2%D8%B1%D8%A7%D8%B9%D9%8A/',
      youtube: 'https://www.youtube.com/watch?v=fYvBf_EUHbM',
    ),
     ModelMusiemApp(
       id:"8",
      title: "متحف التحنيط بالاقصر",
      image: 'assets/images/taheent.jpeg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'يقع متحف التحنيط بالأقصر على كورنيش النيل شمال معبد الأقصر، ويهدف هذا المتحف إلى إبراز تقنيات فن التحنيط الفرعوني القديم التي طبقها قدماء المصريين على العديد من المخلوقات وليس على البشر فقط، حيث تعرض في هذا المتحف الفريد مومياءات لقطط وأسماك وتماسيح، كما يمكننا أيضا معرفة الوسائل التي كانت تستخدم في تلك العملية. وقد قام بافتتاح هذا المتحف الرئيس محمد حسني مبارك سنة 1997',
      siteurl: 'https://egymonuments.gov.eg/ar/museums/mummification-museum',
      youtube: 'https://www.youtube.com/watch?v=DTMVVUnJR7k',
    ),
     ModelMusiemApp(
       id:"9",
      title: "متحف الكرنك",
      image: 'assets/images/karnk2.jpg',
      location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
      brief: 'المتحف المفتوح بالكرنك هو متحف أثري في الأقصر، مصر. يقع في الركن الشمالي الغربي من فناء آمون-رع في مجمع الكرنك.يقع داخل محيط معابد الكرنك، ويضم عدداً من المقاصير المهمة من عصر الدولة الوسطى مثل «المقصورة البيضاء» الخاصة بالملك سنوسرت الأول، بالإضافة إلى مقصورتين من عصر الدولة الحديثة وهما «المقصورة المرمرية» الخاصة بالملك أمنحوتب الأول، و«المقصورة الحمراء» الخاصة بالملكة حتشبسوت، ويضم المتحف أيضاً الكثير من القطع الأثرية مثل تماثيل قرود البابون، وعدداً من الأبواب الوهمية، وغيرها من الآثار الحجرية الضخمة.[1]',
      siteurl: 'https://beta.sis.gov.eg/ar/%D8%A7%D9%84%D9%85%D8%B1%D9%83%D8%B2-%D8%A7%D9%84%D8%A5%D8%B9%D9%84%D8%A7%D9%85%D9%8A/%D8%A7%D9%84%D9%81%D8%B9%D8%A7%D9%84%D9%8A%D8%A7%D8%AA/%D8%AA%D8%B9%D8%A7%D9%85%D8%AF-%D8%A7%D9%84%D8%B4%D9%85%D8%B3-%D8%B9%D9%84%D9%89-%D9%82%D8%AF%D8%B3-%D8%A7%D9%84%D8%A3%D9%82%D8%AF%D8%A7%D8%B3-%D8%A8%D9%85%D8%B9%D8%A8%D8%AF-%D8%A2%D9%85%D9%88%D9%86-%D8%B1%D8%B9-%D9%81%D9%8A-%D8%A7%D9%84%D9%83%D8%B1%D9%86%D9%83/',
      youtube: 'https://www.youtube.com/watch?v=CMR-ReioQtQ',
    
    ),
    ModelMusiemApp(
       id:"10",
      title: "متحف الشمع",
      image: 'assets/images/shame.jpeg',
    location: 'بور سعيد، غيط العدة، الدرب الأحمر، محافظة القاهرة',
    brief: 'متحف الشمع في حلوان متحف مصري يقع في مدينة حلوان بالقاهرة، تم تأسيسه عام 1934، ويضم المتحف العديد من الأعمال الفنية من الشمع وكذلك مقتنيات نادرة لمراحل تطور التاريخ المصري، بداية من الفراعنة وصولا إلى العصر الحديث، يوجد بالمتحف العديد من تماثيل شمعية صنعت بدقة متناهية دفعت متخصصين إلى تصنيفه في المركز الرابع في قائمة أفضل متاحف الشمع في العالم، كما صنف ثاني أشهر متحف شمع في العالم',
      siteurl: 'http://www.moc.gov.eg/ar/affiliates-list/%D9%81%D9%86%D9%88%D9%86-%D8%AA%D8%B4%D9%83%D9%8A%D9%84%D9%8A%D8%A9/%D9%85%D8%AA%D8%AD%D9%81-%D8%A7%D9%84%D8%B4%D9%85%D8%B9/',
      youtube: 'https://www.youtube.com/watch?v=Lzp0Pbzcwz0',
    ),
   
  ];
  /// [getLength] return number item in list
  int getLength() => dataMusem.length;

  
  ModelMusiemApp getMusem(int index) => dataMusem.elementAt(index);

}